/* ************************************************ */
/*File Name: statecode.js
* Author: Pudge
* Mail: EternalNight996@gmail.com
* Created Time: 2021年05月31日 星期一 09时14分33秒
*/

export default {
  "-1": "系统繁忙",
  "0": "请求成功",
  "1001": "资源已存在",
  "1002": "参数错误",
  "1003": "两次密码不一致",
  "1004": "手机号错误",
  "1005": "邮箱格式错误",
  "400": "请求被拒绝",
  "401": "未授权，请登录",
  "403": "拒绝访问",
  "404": "请求地址出错",
  "408": "请求超时",
  "500": "服务器内部错误",
  "501": "服务未实现",
  "502": "网关错误",
  "503": "服务不可用",
  "504": "网关超时",
  "505": "HTTP版本不受支持",
}
